# VoltageTypeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageTypeSet Class
Members See Also
---
A set that contains voltage types.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class VoltageTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class VoltageTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class VoltageTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..VoltageTypeSet
# See Also
VoltageTypeSet Members
Autodesk.Revit.DB.Electrical Namespace